#include <iostream>

int main() {
    int number;
    
    std::cout << "Исследуемое число: ";
    std::cin >> number;
    
    std::cout << "Его побитовое представление:" << number << ":" << std::endl;
    
    // Создание цикла проходящего по всем битам
    for (int i = 31; i >= 0; i--) {
        // (number >> i) & 1 - конструкция с помощью которой мы получим значение iого бита
        // >>i -побитовый сдвиг на i вправо; & - функция которая оставляет только 1 бит, обнуляя остальные 
        std::cout << ((number >> i) & 1);
    }
    std::cout << std::endl;
    
    return 0;
}